# Data Cleaning with Pandas

>“Happy families are all alike; every unhappy family is unhappy in its own way.” –– Leo Tolstoy

>“Tidy datasets are all alike, but every messy dataset is messy in its own way.” –– Hadley Wickham

There are three interrelated rules which make a dataset tidy:

1. Each variable must have its own column.
2. Each observation must have its own row.
3. Each value must have its own cell.

![tidy](img/tidy-1.png)

In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
import untidy
import pandas as pd

We have versions of the same dataset below.
- What makes each of these datasets untidy?
- What would the ideal tidy version of this data look like?
- What code would you use to fix each dataset?

In [28]:
ut_e1 = untidy.exampleone()

In [29]:
ut_e2 = untidy.exampletwo()

In [30]:
ut_e31, ut_e32 = untidy.examplethree()

In [31]:
ut_e1['cases'] = ut_e1.loc[ut_e1['obser'] == 'cases', 'count']
ut_e1.head()
ut_e1['population'] = ut_e1.loc[ut_e1['obser'] == 'population', 'count']
ut_e1.drop(columns = ['obser', 'count'], inplace=True)
ut_e1 = ut_e1.groupby(['country', 'year']).sum()
ut_e1.head()

                    cases   population
country     year
Afghanistan 1999    745.0   19987071.0
            2000   2666.0   20595360.0
Brazil      1999  37737.0  172006362.0

In [35]:
t2 = ut_e2
t2.groupby(['country', 'year']).sum()

                               rate
country     year
Afghanistan 1999       745/19987071
            2000      2666/20595360
Brazil      1999    37737/172006362
            2000    80488/174504898
China       1999  212258/1272915272
            2000  213766/1280428583

In [59]:
t31, t32 = ut_e31, ut_e32

In [60]:
t31

       country    1999    2000
0  Afghanistan     745    2666
1       Brazil   37737   80488
2        China  212258  213766

In [61]:
t32

       country        1999        2000
0  Afghanistan    19987071    20595360
1       Brazil   172006362   174504898
2        China  1272915272  1280428583